In [2]:
df <- read.csv('../Data/Airlinewise Monthly International Air Traffic To And From The Indian Territory.csv')

In [3]:
summary(df)

      YEAR          MONTH      QUARTER           AIRLINE.NAME    CARRIER.TYPE
 Min.   :2015   FEB    : 264   Q1:792   AEROFLOT       :  27   DOMESTIC: 135
 1st Qu.:2015   JAN    : 264   Q2:504   AEROLOGIC      :  27   FOREIGN :2199
 Median :2016   MAR    : 264   Q3:507   AIR ARABIA     :  27
 Mean   :2016   DEC    : 177   Q4:531   AIR ASIA BERHAD:  27
 3rd Qu.:2016   NOV    : 177            AIR ASTANA     :  27
 Max.   :2017   OCT    : 177            AIR AUSTRAL    :  27
                (Other):1011            (Other)        :2172
 PASSENGERS.TO.INDIA PASSENGERS.FROM.INDIA FREIGHT.TO.INDIA
 Min.   :     0      Min.   :     0        Min.   :    0.00
 1st Qu.:  1488      1st Qu.:  1629        1st Qu.:    0.30
 Median :  4960      Median :  5264        Median :   53.95
 Mean   : 24477      Mean   : 25453        Mean   :  550.93
 3rd Qu.: 23290      3rd Qu.: 23419        3rd Qu.:  311.21
 Max.   :402497      Max.   :400155        Max.   :14916.47
 NA's   :1
 FREIGHT.FROM.INDIA
 Min.   :    0.00
 1st Qu.:    8.53
 Median :  154.32
 Mean   :  865.26
 3rd Qu.:  770.03
 Max.   :48640.30

In [4]:
months <- data.frame(unique(df$MONTH))

In [15]:
plot(sort(df$FREIGHT.FROM.INDIA , df$MONTH ))
ylabel("Months")

ERROR: Error in sort(df$FREIGHT.FROM.INDIA, df$MONTH): 'decreasing' must be a length-1 logical vector.
Did you intend to set 'partial'?

In [6]:
utf8ToInt("Bb")

[1] 66 98

In [3]:
data.frame(LETTERS[1:10] , utf8ToInt(paste(LETTERS[0:10],sep="",collapse="")))

   LETTERS.1.10. utf8ToInt.paste.LETTERS.0.10...sep.......collapse.......
1  A             65
2  B             66
3  C             67
4  D             68
5  E             69
6  F             70
7  G             71
8  H             72
9  I             73
10 J             74

In [4]:
ls()

character(0)

## Encryption and Decryption

In [5]:
message = utf8ToInt("Tejas is a boy")
code = 13 #Code should always be a prime number

rem = message %% code
quotient = message %/% code

final_codeVector = quotient * code + rem

In [6]:
intToUtf8(final_codeVector)

[1] "Tejas is a boy"

In [7]:
'Tejas'

[1] "Tejas"

In [48]:
df = data.frame(Names = c('Radha','Monika','Sawan','Ram','Tejas') , Surnames = c('Rao','Sharma','Doshi','Ranade','Shinde'))

In [49]:
df

  Names  Surnames
1 Radha  Rao
2 Monika Sharma
3 Sawan  Doshi
4 Ram    Ranade
5 Tejas  Shinde

In [50]:
findInitials = function(name , surname)
    {
        return (paste(substr(name , 1 , 1) , substr(surname , 1 , 1) , sep = "" , collapse = ""))
    }

In [51]:
vowelCount = function(name)
    {
        coll = is.element(unlist(strsplit(tolower(name),'')),c('a','e','i','o','u'))
        return (length(coll[coll == TRUE]))
    }

In [52]:
removeVowel = function (name)
    {
        return (gsub('a|e|i|o|u','',name))
    }

In [53]:
match('a' , unlist(strsplit('Tejaas' , '')))

[1] 4

In [54]:
vowelCount('Tejaaas')

[1] 4

In [55]:
findInitials('Tejas','Shinde')

[1] "TS"

In [56]:
df$removeVowelsFN = apply(df[1] , removeVowel , MARGIN = 1)

In [57]:
df$VowelCount = apply(df[1] , vowelCount , MARGIN = 1)

In [58]:
df$Initials = mapply(findInitials , df$Names , df$Surnames)

In [59]:
df$LengthInSurname = apply(df[2] , nchar , MARGIN = 1)

In [60]:
df

  Names  Surnames removeVowelsFN VowelCount Initials LengthInSurname
1 Radha  Rao      Rdh            2          RR       3
2 Monika Sharma   Mnk            3          MS       6
3 Sawan  Doshi    Swn            2          SD       5
4 Ram    Ranade   Rm             1          RR       6
5 Tejas  Shinde   Tjs            2          TS       6

In [63]:
rbind(df , c(apply(df , vowelCount , MARGIN = 2)))

Warning message in `[<-.factor`(`*tmp*`, ri, value = 10L):
"invalid factor level, NA generated"Warning message in `[<-.factor`(`*tmp*`, ri, value = 11L):
"invalid factor level, NA generated"

  Names  Surnames removeVowelsFN VowelCount Initials LengthInSurname
1 Radha  Rao      Rdh            2          RR       3
2 Monika Sharma   Mnk            3          MS       6
3 Sawan  Doshi    Swn            2          SD       5
4 Ram    Ranade   Rm             1          RR       6
5 Tejas  Shinde   Tjs            2          TS       6
6 NA     NA       0              0          0        0

In [74]:
dataframe = data.frame(Numbers = 1:10)
sqre = function(number){return (number ^ 2)}

In [73]:
dataframe$sqrt = apply(dataframe[1] , sqrt , MARGIN = 1)
dataframe$square = apply(data.frame[1] , function(number){return (number ^ 2)} , MARGIN = 1)

ERROR: Error in data.frame[1]: object of type 'closure' is not subsettable

In [69]:
dataframe

   Numbers sqrt
1   1      1.000000
2   2      1.414214
3   3      1.732051
4   4      2.000000
5   5      2.236068
6   6      2.449490
7   7      2.645751
8   8      2.828427
9   9      3.000000
10 10      3.162278